# Дан список чисел. Определите, сколько в нем встречается различных чисел.

a = [1, 1, 2, 0, -1, 3, 4, 4]
b = set(a)
print(len(b))