# Напишите программу для печати всех уникальных значений в словаре. 
# Input:  [{"V": "S001"}, {"V": "S002"}, {"VI": "S001"}, {"VI": "S005"}, {"VII": " S005 "}, {" V ":" S009 "}, {" VIII ":" S007 "}] 
# Output: {'S005', 'S002', 'S007', 'S001', 'S009'}

sp = [{"V": "S001"}, {"V": "S002"}, {"VI": "S001"}, {"VI": "S005"}, {"VII": " S005 "}, {" V ":" S009 "}, {" VIII ":" S007 "}]

# 1
# a = []

# for i in sp:
#     for key, value in i.items():        # проходим по значениям словаря
#         a.append(value.strip())         # присоединяем к списку а значение из словаря *без пробелов в начале и конце строки*
# b = set(a)
# print(b)

# 2
s = set()
for d in sp:
    for value in d.values():
        s.add(value.strip())
print(s)